
genres = ["Боевик", "Комедия", "Драма", "Фантастика", "Триллер", "Ужасы", "Мультфильм", "Приключения", "Фэнтези", "Детектив"]
years =  (2009, 2024)

movies = {
    1: {"title": "Последний герой 1", "genre": "Приключения", "year": 2009},
    2: {"title": "Жизнь Пи 2", "genre": "Мультфильм", "year": 2011},
    3: {"title": "Бегущий по лезвию 2049 3", "genre": "Комедия", "year": 2019},
    4: {"title": "1917 4", "genre": "Боевик", "year": 2011},
    5: {"title": "Шаг вперед 5", "genre": "Детектив", "year": 2023},
    6: {"title": "Джентльмены 6", "genre": "Триллер", "year": 2020},
    7: {"title": "Бумажные города 7", "genre": "Приключения", "year": 2021},
    8: {"title": "Тайна старого замка 8", "genre": "Фэнтези", "year": 2019},
    9: {"title": "Сердце ангела 9", "genre": "Мультфильм", "year": 2010},
    10: {"title": "Форрест Гамп 10", "genre": "Фантастика", "year": 2011},
    11: {"title": "Формула успеха 11", "genre": "Триллер", "year": 2015},
    12: {"title": "Волк с Уолл-стрит 12", "genre": "Фэнтези", "year": 2012},
    13: {"title": "12 лет рабства 13", "genre": "Драма", "year": 2014},
    14: {"title": "Тор: Рагнарёк 14", "genre": "Приключения", "year": 2011},
    15: {"title": "Виртуальная реальность 15", "genre": "Мультфильм", "year": 2009},
    16: {"title": "Афера по-американски 16", "genre": "Комедия", "year": 2016},
    17: {"title": "Сердце ангела 17", "genre": "Мультфильм", "year": 2016},
    18: {"title": "Эпоха драконов 18", "genre": "Фантастика", "year": 2011},
    19: {"title": "Сумерки 19", "genre": "Фэнтези", "year": 2020},
    20: {"title": "До встречи с тобой 20", "genre": "Мультфильм", "year": 2022},
    21: {"title": "Гравитация 21", "genre": "Детектив", "year": 2023},
    22: {"title": "В зоне риска 22", "genre": "Драма", "year": 2016},
    23: {"title": "Гарри Поттер 23", "genre": "Боевик", "year": 2023},
    24: {"title": "Падение империи 24", "genre": "Приключения", "year": 2011},
    25: {"title": "Черная Пантера 25", "genre": "Детектив", "year": 2022},
    26: {"title": "Форма воды 26", "genre": "Фантастика", "year": 2017},
    27: {"title": "Паразиты 27", "genre": "Комедия", "year": 2015},
    28: {"title": "Социальная сеть 28", "genre": "Триллер", "year": 2021},
    29: {"title": "Бойцовский клуб 29", "genre": "Фэнтези", "year": 2016},
    30: {"title": "Прибытие 30", "genre": "Детектив", "year": 2020},
    31: {"title": "Город теней 31", "genre": "Драма", "year": 2014},
    32: {"title": "Достать ножи 32", "genre": "Приключения", "year": 2014},
    33: {"title": "Тайна старого замка 33", "genre": "Комедия", "year": 2024},
    34: {"title": "Великий Гэтсби 34", "genre": "Приключения", "year": 2015},
    35: {"title": "Форма воды 35", "genre": "Фэнтези", "year": 2017},
    36: {"title": "Форрест Гамп 36", "genre": "Приключения", "year": 2022},
    37: {"title": "1917 37", "genre": "Боевик", "year": 2011},
    38: {"title": "Падение империи 38", "genre": "Приключения", "year": 2012},
    39: {"title": "Большой Лебовски 39", "genre": "Ужасы", "year": 2019},
    40: {"title": "Черная Пантера 40", "genre": "Приключения", "year": 2014},
    41: {"title": "Виртуальная реальность 41", "genre": "Фантастика", "year": 2020},
    42: {"title": "Король говорит! 42", "genre": "Комедия", "year": 2022},
    43: {"title": "Меч короля Артура 43", "genre": "Мультфильм", "year": 2017},
    44: {"title": "Код да Винчи 44", "genre": "Детектив", "year": 2015},
    45: {"title": "Бердмен 45", "genre": "Приключения", "year": 2011},
    46: {"title": "Великий Гэтсби 46", "genre": "Комедия", "year": 2023},
    47: {"title": "Черный лебедь 47", "genre": "Фантастика", "year": 2024},
    48: {"title": "Ангелы и демоны 48", "genre": "Мультфильм", "year": 2009},
    49: {"title": "Сердце ангела 49", "genre": "Мультфильм", "year": 2013},
    50: {"title": "Гравитация 50", "genre": "Комедия", "year": 2013}
}

# Пример использования:
#print(movies[1]["title"]) # Выведет: Последний герой 1
#print(movies[5]["genre"]) # Выведет: Детектив
#print(movies[10]["year"]) # Выведет: 2011
