
genres = ["Боевик", "Комедия", "Драма", "Фантастика", "Триллер", "Ужасы", "Мультфильм", "Приключения", "Фэнтези", "Детектив"]
years =  (2020, 2025)

movies = {
    1: {"title": "Последний герой", "genre": "Приключения", "year": 2024},
    2: {"title": "Жизнь Пи", "genre": "Мультфильм", "year": 2021},
    3: {"title": "Бегущий по лезвию 2049", "genre": "Комедия", "year": 2024},
    4: {"title": "1917", "genre": "Боевик", "year": 2021},
    5: {"title": "Шаг вперед", "genre": "Детектив", "year": 2023},
    6: {"title": "Джентльмены", "genre": "Триллер", "year": 2020},
    7: {"title": "Бумажные города", "genre": "Приключения", "year": 2021},
    8: {"title": "Тайна старого замка", "genre": "Фэнтези", "year": 2024},
    9: {"title": "Сердце ангела", "genre": "Мультфильм", "year": 2020},
    10: {"title": "Форрест Гамп", "genre": "Фантастика", "year": 2021},
    11: {"title": "Формула успеха", "genre": "Триллер", "year": 2020},
    12: {"title": "Волк с Уолл-стрит", "genre": "Фэнтези", "year": 2022},
    13: {"title": "12 лет рабства", "genre": "Драма", "year": 2024},
    14: {"title": "Тор: Рагнарёк", "genre": "Приключения", "year": 2021},
    15: {"title": "Виртуальная реальность", "genre": "Мультфильм", "year": 2024},
    16: {"title": "Афера по-американски", "genre": "Комедия", "year": 2021},
    17: {"title": "Сердце ангела", "genre": "Мультфильм", "year": 2021},
    18: {"title": "Эпоха драконов", "genre": "Фантастика", "year": 2021},
    19: {"title": "Сумерки", "genre": "Фэнтези", "year": 2020},
    20: {"title": "До встречи с тобой", "genre": "Мультфильм", "year": 2022},
    21: {"title": "Гравитация", "genre": "Детектив", "year": 2023},
    22: {"title": "В зоне риска", "genre": "Драма", "year": 2021},
    23: {"title": "Гарри Поттер", "genre": "Боевик", "year": 2023},
    24: {"title": "Падение империи", "genre": "Приключения", "year": 2021},
    25: {"title": "Черная Пантера", "genre": "Детектив", "year": 2022},
    26: {"title": "Форма воды", "genre": "Фантастика", "year": 2022},
    27: {"title": "Паразиты", "genre": "Комедия", "year": 2020},
    28: {"title": "Социальная сеть", "genre": "Триллер", "year": 2021},
    29: {"title": "Бойцовский клуб", "genre": "Фэнтези", "year": 2021},
    30: {"title": "Прибытие", "genre": "Детектив", "year": 2020},
    31: {"title": "Город теней", "genre": "Драма", "year": 2024},
    32: {"title": "Достать ножи", "genre": "Приключения", "year": 2024},
    33: {"title": "Тайна старого замка", "genre": "Комедия", "year": 2024},
    34: {"title": "Великий Гэтсби", "genre": "Приключения", "year": 2020},
    35: {"title": "Форма воды", "genre": "Фэнтези", "year": 2022},
    36: {"title": "Форрест Гамп", "genre": "Приключения", "year": 2022},
    37: {"title": "1917", "genre": "Боевик", "year": 2021},
    38: {"title": "Падение империи", "genre": "Приключения", "year": 2022},
    39: {"title": "Большой Лебовски", "genre": "Ужасы", "year": 2024},
    40: {"title": "Черная Пантера", "genre": "Приключения", "year": 2024},
    41: {"title": "Виртуальная реальность", "genre": "Фантастика", "year": 2020},
    42: {"title": "Король говорит!", "genre": "Комедия", "year": 2022},
    43: {"title": "Меч короля Артура", "genre": "Мультфильм", "year": 2022},
    44: {"title": "Код да Винчи", "genre": "Детектив", "year": 2020},
    45: {"title": "Бердмен", "genre": "Приключения", "year": 2021},
    46: {"title": "Великий Гэтсби", "genre": "Комедия", "year": 2023},
    47: {"title": "Черный лебедь", "genre": "Фантастика", "year": 2024},
    48: {"title": "Ангелы и демоны", "genre": "Мультфильм", "year": 2024},
    49: {"title": "Сердце ангела", "genre": "Мультфильм", "year": 2023},
    50: {"title": "Гравитация", "genre": "Комедия", "year": 2023}
}


# def search_film(search_genre, search_year):
#     lst_film = []
#     for key in movies:
#         movie = movies[key]
#         if movie['genre'] == search_genre and movie['year'] == search_year:
#             lst_film.append(movie['title'])
#     return lst_film